{
  "structure_type": "three-act",
  "acts": [
    {
      "title": "Act 1: Setup",
      "description": "Introduce the protagonist in their ordinary world. Establish the status quo, their wants/needs, relationships, and the story world. Show what's at stake.",
      "story_application": "Elara scavenges in the Bone Market, half-fused with Lyra's skeletal remains, weaving bone-lace from scavenged relics while whispering to Lyra's corpse. Silas meticulously maintains Lyra's clockwork heart in his Conservatory, believing her mechanical preservation will save Veridian. The city's whispering stones and decaying clockwork angels underscore their shared grief and the fragile magic holding Veridian together.",
      "percentage": 0.25,
      "order": 0,
      "sub_acts": [
        {
          "title": "Opening Image",
          "description": "The protagonist's life before the adventure begins. Shows who they are and what's missing.",
          "story_application": "Elara's form flickers between living and skeletal as she collects rib bones in the Bone Market, her shadow-stitched whispers echoing Lyra's name. Her fused state—part human, part bone—mirrors Veridian's own decay, with streets crumbling beneath her feet as she seeks materials to 'complete' Lyra.",
          "percentage": 0.05,
          "order": 0,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Setup & Theme Stated",
          "description": "Establish the world, supporting characters, and hint at the story's theme or moral question.",
          "story_application": "Veridian's whispering streets react to Elara's grief, amplifying her obsession, while Silas's Conservatory hums with clockwork precision. Master Thorne's fragmented ghost warns of 'the cost of holding the dead,' and Anya documents the city's decay in glowing ink, framing love's corruption as Veridian's inevitable end.",
          "percentage": 0.1,
          "order": 1,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Inciting Incident",
          "description": "The event that disrupts the status quo and sets the story in motion. The protagonist can't ignore this.",
          "story_application": "Elara storms Silas's Conservatory, demanding he surrender Lyra's heart, triggering a duel at the Aethelian Mausoleum. Their clashing magics—bone-lace vs. clockwork gears—shatter the city's fragile reality, fracturing streets into dimensional rifts and bleeding Veridian's dying sun into voids.",
          "percentage": 0.1,
          "order": 2,
          "sub_acts": [],
          "scenes": []
        }
      ],
      "scenes": []
    },
    {
      "title": "Act 2: Confrontation",
      "description": "The protagonist pursues their goal but faces escalating obstacles. Complications arise and stakes increase. Tests and trials reveal character.",
      "story_application": "Elara and Silas's duel accelerates Veridian's decay, with each spell wrecking the city: phosphorescent fungi bloom from Lyra's ribs, grinding gears cascade from her chest cavity. Master Thorne intervenes to stop them, but his hesitation—born of guilt over Lyra's death—allows the city to fracture further, while Kael's grief clouds his attempts to mediate.",
      "percentage": 0.5,
      "order": 1,
      "sub_acts": [
        {
          "title": "Rising Action",
          "description": "The protagonist commits to their goal and enters a new world/situation. Faces initial obstacles and learns new skills.",
          "story_application": "Elara uses bone-lace to anchor Lyra's corpse against Silas's clockwork heart, but the Mausoleum's fossilized starlight fractures, revealing cosmic horrors. Silas's Conservatory becomes vulnerable as Elara disrupts his rituals, forcing him to defend his relic while Veridian's streets collapse into the Shattered Spire.",
          "percentage": 0.2,
          "order": 0,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Midpoint",
          "description": "A major revelation, victory, or defeat that changes what the protagonist believes or wants. Raises the stakes significantly.",
          "story_application": "Master Thorne reveals his past failure: he tried to save Lyra, causing her death, and now must choose between stopping Elara/Silas or letting Veridian perish. This shatters Silas's belief in 'perfect preservation,' as Lyra's mechanical heart begins to decay, and Elara realizes her obsession is killing Veridian.",
          "percentage": 0.1,
          "order": 1,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Downward Spiral",
          "description": "Consequences of the midpoint compound. Enemies close in, allies are tested, and the protagonist's flaws cause problems.",
          "story_application": "Kael's grief makes him side with Silas, delaying his attempt to halt the duel. The city fractures further: the Shattered Spire opens, unleashing eldritch decay that consumes the Whispering Streets. Elara's bone-lace magic backfires, fusing her more deeply with Lyra's corpse, while Silas's clockwork heart falters, accelerating Veridian's collapse.",
          "percentage": 0.15,
          "order": 2,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Crisis",
          "description": "All seems lost—the darkest moment. The protagonist faces their greatest challenge or failure. Forces a crucial decision.",
          "story_application": "Veridian teeters on total collapse as the void consumes the Mausoleum. Master Thorne, sacrificing his existence, urges both to choose: 'Lyra is not a relic, nor a ghost—she was alive.' Elara and Silas stand frozen, their obsession about to doom all remaining life.",
          "percentage": 0.05,
          "order": 3,
          "sub_acts": [],
          "scenes": []
        }
      ],
      "scenes": []
    },
    {
      "title": "Act 3: Resolution",
      "description": "The final confrontation and its aftermath. The protagonist applies what they've learned. Resolve the main conflict and show the new status quo.",
      "story_application": "Elara releases Lyra's corpse into the void, accepting her death, while Silas dismantles the clockwork heart, allowing Veridian's magic to stabilize. The city's decay halts as the dying sun bleeds back into light, and Master Thorne's ghost fades peacefully, his guilt resolved.",
      "percentage": 0.25,
      "order": 2,
      "sub_acts": [
        {
          "title": "Climax",
          "description": "The final confrontation with the antagonist or challenge. High tension, decisive action, all skills and lessons applied.",
          "story_application": "Elara and Silas simultaneously stop their magics: Elara lets Lyra's bones dissolve into starlight, Silas shatters the heart. Their combined act of release halts the void, with the Mausoleum's fossilized starlight reknitting Veridian's magic. The Shattered Spire collapses inward, sealing the rifts.",
          "percentage": 0.15,
          "order": 0,
          "sub_acts": [],
          "scenes": []
        },
        {
          "title": "Resolution & New World",
          "description": "The aftermath. Show how the protagonist and world have changed. Tie up loose ends and hint at the future.",
          "story_application": "Veridian stabilizes, its whispering stones now silent. Elara walks the streets, no longer fused with bone, while Silas begins rebuilding the city's magic with humility. Anya's journal closes with 'the beauty of decay is not in clinging, but in letting go,' and Kael finds peace in honoring his sister's memory.",
          "percentage": 0.1,
          "order": 1,
          "sub_acts": [],
          "scenes": []
        }
      ],
      "scenes": []
    }
  ]
}
