[
  {
    "name": "Elara the Bone-Singer",
    "role": "protagonist",
    "bio": "A necromancer whose body is half-fused with the skeletal remains of her beloved Lyra, she weaves bone-lace and shadow-stitched whispers from Lyra's corpse. Her grief has twisted her into a living monument of sorrow, speaking in fragmented cadence with the dead.",
    "goal": "To resurrect Lyra fully, erasing the memory of Silas's betrayal and restoring their love as it was before death.",
    "flaw": "Her obsession consumes her identity, making her unable to see that Lyra's corpse is already a prison of decay, not a vessel for rebirth.",
    "arc": "To accept that love cannot outlive death, and that clinging to Lyra's corpse is the true corruption."
  },
  {
    "name": "Silas the Gilded Crypt-Weaver",
    "role": "antagonist",
    "bio": "A necromancer who preserves Lyra's corpse through arcane clockwork, believing her heart's mechanical pulse can be made eternal. He views emotion as a flaw, his movements precise and his voice cold as grinding gears.",
    "goal": "To claim Lyra's corpse as a perfect, unchanging relic, using its clockwork heart to stabilize Veridian's dying magic.",
    "flaw": "His belief in cold, logical perfection blinds him to the emotional truth that Lyra's humanity was inseparable from her mortality.",
    "arc": "To confront the hollowness of his 'perfection' when his clockwork heart shatters under the weight of Lyra's true, messy love."
  },
  {
    "name": "Master Thorne",
    "role": "mentor",
    "bio": "A ghostly, fragmented echo of the city's last great necromancer, his consciousness bound to the Aethelian Mausoleum's ruins. He speaks in broken clockwork rhythms, his form flickering with dying starlight.",
    "goal": "To prevent Elara and Silas from unraveling Veridian's final magic, even if it means sacrificing his own existence.",
    "flaw": "Haunted by his own past failure—his attempt to save Lyra's life inadvertently caused her death—he hesitates to act decisively.",
    "arc": null
  },
  {
    "name": "Kael",
    "role": "ally",
    "bio": "A street urchin who scavenges in Veridian's ruins, haunted by the recent death of his own sister. He knows the city's hidden paths and speaks to the whispering stones.",
    "goal": "To stop the battle before Veridian collapses into the void, saving the few remaining survivors from the city's decay.",
    "flaw": "His grief for his sister makes him see Silas and Elara as mirrors of his own loss, clouding his judgment and delaying action.",
    "arc": "To move beyond his personal pain and find a way to heal the city without forcing love to live in death."
  },
  {
    "name": "Anya",
    "role": "foil",
    "bio": "A scholar of Veridian's dying magic, who records the city's decay in a journal of glowing ink. She studies the fractures in reality with detached fascination, seeing beauty in the unraveling.",
    "goal": "To document Veridian's final moments as a perfect, inevitable end to its cycle of entropy.",
    "flaw": "Her intellectual detachment prevents her from understanding that the city's decay is caused by human obsession, not cosmic inevitability.",
    "arc": "To realize that her detached observation is complicit in the destruction she admires."
  }
]
